{
  "UniqueName": "MicroPatches",
  "Version": "1.4.0",
  "DisplayName": "MicroPatches",
  "Description": "[h1]MicroPatches (Warhammer 40K: Rogue Trader)[/h1]\n\nTransmechanic Microsoftenator once again fixing bugs and cleaning logs.\n\nTiny patches attempting to fix minor bugs and silence annoying log messages.\nExperimental patches require more testing and can be toggled in the mod settings (requires restart to take effect). If you encounter any issues with an experimental patch, [url=https://github.com/microsoftenator2022/MicroPatches/issues]let me know in the issues on the github repository[/url].\n\n[u][b]WARNING: ALL EXPERIMENTAL PATCHES ARE DISABLED BY DEFAULT FOR A REASON. THEY MAY BREAK YOUR GAME AND/OR SAVES. ACTIVATE AT YOUR OWN RISK.[/b][/u]\n\n[h2]Current patches as of 1.2:[/h2]\n\n[h3]Ported from WrathPatches[/h3]\n\n[list]\n[*]Fixed NRE in Element.AssetGuid and Element.AssetGuidShort\n[*]SharedStringConverter.ReadJson now correctly uses ScriptableObject.CreateInstance not the class constructor. Fixes harmless but noisy template mod localization errors\n[*]Silenced \"Bind: no binding named X\" messages\n[/list]\n\n[h3]Experimental[/h3]\n\nThese have all recieved basic testing, but are not guaranteed to be free of issues:\n[list]\n[*]Swap calculations for CasterNamedProperty and TargetNamedProperty. Fix for: Some effects that should be using the caster's stats incorrectly use the target's stats and vice-versa.\n[*]Ignore TurnBasedEventsTrigger on features on non-party companions. Fixes the \"Infinite Seize The Initiative\" bug\n[*]Fixed EGSAchievementsManager NullReferenceExceptions\n[*]Ignore Steam Achievements with Null ID\n[*]Lowered the severity of missing save file warnings (\"DLC has no status in the DLCCache. Defaulting to unavailable\") no longer prints a stacktrace\n[*]Silenced keybinding conflict messages\n[*]Skip LoadAssigneeAsync - prevents internal QA error message\n[/list]",
  "Author": "Microsoftenator",
  "ImageName": "Thumbnail.jpg",
  "WorkshopId": "3102417218",
  "Repository": "",
  "HomePage": "",
  "Dependencies": []
}